[
    {
        "location": "<ul>\n<li>Crimson jobfish are distributed throughout the Indo-Pacific region.</li>\n<li>They inhabit hard bottoms at depths from 40 to 120 fathoms.</li>\n</ul>\n",
        "rarity": 1,
        "species_name": "Crimson Jobfish",
        "scientific_name": "Pristipomoides filamentosus",
        "NOAA_fisheries_region": "Pacific Islands",
        "population": "The population level is unknown, but the stock is contained in 5 bottomfish complexes whose status ranges from overfished to not overfished to unknown.",
        "physical_description": "<ul>\n<li>Crimson jobfish have skin that is slightly brown with some brighter colors when caught over hard bottoms.</li>\n<li>Their caudal fin has an orange edge.</li>\n<li>Pectoral fins are brownish or yellow.</li>\n<li>The iris is typically yellow.</li>\n</ul>\n",
        "biology": "<ul>\n<li>Crimson jobfish reach sexual maturity around 1.8 years of age.</li>\n<li>Spawning occurs between June and December with a peak in August.</li>\n<li>Large fish reach about 20 lb and 3 feet long.</li>\n<li>They feed on shrimps, squids, and small fishes.</li>\n</ul>\n",
        "taste": "<p>Crimson jobfish has a delicate flavor.</p>\n",
        "texture": "<p>Crimson jobfish has&nbsp;a firm texture and can be prepared in a variety of ways from steaming smaller-sized fish to fillets for sashimi.</p>\n"
    },
    {
        "location": "<ul>\n<li>White hake are found in the northwest Atlantic Ocean from Newfoundland to southern New England.</li>\n</ul>\n",
        "rarity": 1,
        "species_name": "White Hake",
        "scientific_name": "Urophycis tenuis",
        "NOAA_fisheries_region": "Greater Atlantic",
        "population": "Significantly below target population level. A rebuilding plan is in place.",
        "physical_description": "<ul>\n<li>White hake have a large mouth that extends back below their eyes.</li>\n<li>White hake have one anal fin and two dorsal fins. The first dorsal fin is tall and triangular, and the second is lower, rounded, and extends almost to the fish’s tail.</li>\n<li>The third fin ray on the first (triangular) dorsal fin is elongated and extends much higher than the rest of the fin.</li>\n<li>White hake are a member of the cod order and have a barbel (whisker) on their chin.</li>\n<li>White hake vary in color; most adults range from purplish-brown to golden-brown on their back and sides, and they have a yellowish-white belly speckled with small black spots.</li>\n</ul>\n",
        "biology": "<ul>\n<li>White hake can grow up to 53 inches and weigh up to 49 pounds.</li>\n<li>White hake eggs are buoyant, and larval and early juvenile fish live higher in the water column than adult fish.</li>\n<li>White hake settle to the bottom when they are about 2 months old.</li>\n<li>Adult white hake typically prefer deeper water than juveniles.</li>\n<li>White hake move inshore to shallower waters in the summer and move offshore to deeper waters during the winter.</li>\n<li>Male white hake are usually smaller than females.</li>\n<li>Adult white hake primarily prey on other bottom-dwelling organisms, such as squid, crustaceans, and small bony fish.</li>\n</ul>\n",
        "taste": "<p>White hake has a mild, almost sweet&nbsp;taste.</p>\n",
        "texture": "<p>White hake has a soft, delicate texture that does not stand up well to freezing.</p>\n"
    },
    {
        "location": "<ul>\n<li>Atlantic chub mackerel in the western Atlantic Ocean range from Nova Scotia (where they are rare) through Argentina, including the Gulf of Mexico.&nbsp;&nbsp;</li>\n<li>They are a schooling pelagic species that are found on the continental shelf to depths of about 250–300 meters throughout much of the western and eastern Atlantic Ocean.</li>\n</ul>\n",
        "rarity": 1,
        "species_name": "Atlantic Chub Mackerel",
        "scientific_name": "Scomber colias",
        "NOAA_fisheries_region": "Greater Atlantic",
        "population": " The stock has never been assessed. The population level is unknown but presumed stable.",
        "physical_description": "<ul>\n<li>Atlantic chub mackerel are elongated and streamlined with deeply forked tails.&nbsp;</li>\n<li>They have small spines on the dorsal fin.&nbsp;</li>\n<li>They are silvery in color, with greenish-blue backs. The upper surfaces have dark zigzagging stripes, and the bellies are pale and marked with wavy lines.</li>\n</ul>\n",
        "biology": "<ul>\n<li>Atlantic chub mackerel grow up to 22 inches long and 3.5 pounds.</li>\n<li>They have a life span of up to about 7 years.</li>\n<li>They mainly feed on small crustaceans called copepods and tiny aquatic animals known as wheel animals or rotifers.</li>\n</ul>\n",
        "taste": "<p>Rich, pronounced flavor.</p>\n",
        "texture": "<p>Soft, flaky, and moist.</p>\n"
    },
    {
        "location": "<ul>\n<li>Shortfin squid inhabits the continental shelf and slope waters of the Northwest Atlantic Ocean, from Newfoundland to the central east coast of Florida.</li>\n<li>In the northwest Atlantic Ocean, shortfin squid are most often caught along the continental shelf break in depths between 150 to 275 meters.</li>\n</ul>\n",
        "rarity": 1,
        "species_name": "Shortfin Squid",
        "scientific_name": "Illex illecebrosus",
        "NOAA_fisheries_region": "Greater Atlantic",
        "population": "The population level is unknown. The species has a lifespan of less than one year.",
        "physical_description": "<ul>\n<li>Female shortfin squid range from 7 to 12 inches in mantle length, while males are 7 to 10.6 inches in mantle length.</li>\n<li>They can regulate their body color, but are primarily orange-colored with a brown stripe that extends along the top side of the mantle.</li>\n</ul>\n",
        "biology": "<ul>\n<li>Shortfin squid live for less than one year. They have a high natural mortality rate, and a long spawning season.</li>\n<li>Females can release multiple egg masses during a single spawning season, but die after they spawn. Spawning can occur year round with seasonal peaks from October to June.</li>\n<li>Shortfin squid have extremely variable birth, growth, and maturity rates. This makes them extremely sensitive to climate-driven changes.&nbsp;</li>\n<li>They grow about one millimeter a day.</li>\n<li>Shortfin squid are visual predators that eat crustaceans, fish, and other squid, including their own species.</li>\n<li>They are food for many fish, including <a href=\"https://www.fishwatch.gov/profiles/western-atlantic-bluefin-tuna\">bluefin tuna</a>, <a href=\"https://www.fishwatch.gov/profiles/silver-hake\">silver hake</a>, <a href=\"https://www.fishwatch.gov/profiles/red-hake\">red hake</a>, <a href=\"https://www.fishwatch.gov/profiles/bluefish\">bluefish</a>, <a href=\"https://www.fishwatch.gov/profiles/monkfish\">goosefish</a>, fourspot flounder, <a href=\"https://www.fishwatch.gov/profiles/atlantic-cod\">Atlantic cod</a>, sea raven, <a href=\"https://www.fishwatch.gov/profiles/atlantic-spiny-dogfish\">spiny dogfish</a>, and <a href=\"https://www.fishwatch.gov/profiles/north-atlantic-swordfish\">swordfish</a>. Seabird predators include shearwaters, gannets, and fulmars.</li>\n<li>Shortfin squid undergo daily vertical migrations between cooler deep water and warmer surface water. They are nearest the seabed during the day, and higher in the water column during the night.</li>\n</ul>\n",
        "taste": "<p>Mild, and subtly sweet.</p>\n<p>&nbsp;</p>\n",
        "texture": "<p>Firm and meaty.</p>\n"
    },
    {
        "location": "<ul>\n<li>American lobsters are found in the northwest Atlantic Ocean from Labrador to Cape Hatteras. They’re most abundant in coastal waters from Maine through New Jersey, and are also common offshore to depths of 2,300 feet from Maine through North Carolina.</li>\n</ul>\n",
        "rarity": 1,
        "species_name": "American Lobster",
        "scientific_name": "Homarus americanus",
        "NOAA_fisheries_region": "Greater Atlantic",
        "population": "Above target population levels in the Gulf of Maine and Georges Bank. Significantly below target levels in Southern New England.",
        "physical_description": "<ul>\n<li>American lobster is a crustacean with a large shrimp-like body and 10 legs, two of which are large, strong claws.</li>\n</ul>\n<ul>\n<li>One claw is a big-toothed crusher claw for pulverizing shells, and the other is a finer-edged ripper claw, resembling a steak knife, for tearing soft flesh.</li>\n</ul>\n<ul>\n<li><a href=\"https://www.greateratlantic.fisheries.noaa.gov/regs/infodocs/lobster_sex_id.pdf\">Male and female lobsters</a> can be distinguished by the first pair of swimmerets (pleopods) on the upper portion of the underside of the tail. The male swimmerets are larger and more rigid. The female swimmerets are softer, smaller, and have rounded edges.</li>\n</ul>\n<ul>\n<li>Live lobsters are not red like those you see in a restaurant or grocery store, after they have been cooked. Most are either olive-green or greenish-brown. Some have orange, reddish, dark green, or black speckles and bluish colors in the joints of their appendages.</li>\n</ul>\n",
        "biology": "<ul>\n<li>American lobsters have a long life span. It’s difficult to determine their exact age because they shed their hard shell when they molt, leaving no evidence of age. But scientists believe some American lobsters may live to be 100 years old.</li>\n</ul>\n<ul>\n<li>They can weigh up to 44 pounds.</li>\n</ul>\n<ul>\n<li>Lobsters must periodically molt in order to grow, shedding their hard, external skeleton (shell) when they grow too large for it and forming a new one. They eat voraciously after they molt, often devouring their own recently vacated shells. Eating their shell replenishes lost calcium and helps harden their new shell.</li>\n</ul>\n<ul>\n<li>Lobsters molt about 20 to 25 times over a period of 5 to 8 years between the time they hatch and when they are able to reproduce and reach the minimum legal size to be harvested.</li>\n</ul>\n<ul>\n<li>Usually, lobsters mate after the females molt. Males deposit sperm in the soft-shelled females. The female stores the sperm internally for up to a year.</li>\n</ul>\n<ul>\n<li>Females can have 5,000 to more than 100,000 eggs, depending on their size. The eggs are fertilized as females release them on the underside of their tails, where they carry the eggs for 9 to 11 months.</li>\n</ul>\n<ul>\n<li>Egg-bearing females move inshore to hatch their eggs during late spring or early summer.</li>\n</ul>\n<ul>\n<li>The pelagic (free-swimming) larvae molt four times before they resemble adults and settle to the bottom.</li>\n</ul>\n<ul>\n<li>Lobsters are opportunistic feeders, feeding on whatever prey is most available, so their diet varies regionally.</li>\n</ul>\n<ul>\n<li>Larvae and postlarvae are carnivorous and eat zooplankton (tiny floating animals) during their first year.</li>\n</ul>\n<ul>\n<li>Adults are omnivorous, feeding on crabs, mollusks, worms, sea urchins, sea stars, fish, and macroalgae.</li>\n</ul>\n<ul>\n<li>In general, a variety of bottom-dwelling species feed on lobster, including fish, sharks, rays, skates, octopuses, and crabs. Young lobsters are especially vulnerable to predators. Large, hard-shelled lobsters may be immune to predators (except humans).</li>\n</ul>\n",
        "taste": "<p>Mild and sweet.</p>\n",
        "texture": "<p>The meat is firm and somewhat fibrous. The tail meat is firmer than the meat from the claws.</p>\n"
    }
]